app/controllers/api/v1/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        activities = Activity.all

SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        activity = Activity.find(params[:id])