app/controllers/api/v1/teams_controller.rb

    def show
        team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        team = Team.create(team_params)
        activity = Activity.find(params[:activity_id])
            activity.update(number_of_teams: activity.number_of_teams+1)
---
INSERT INTO "teams" ("name", "location", "number_of_members", "logo_path", "description", "won_games", "tie_games", "lost_games", "admin_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "activities" SET "number_of_teams" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["number_of_teams", 1], ["updated_at", "2019-12-17 20:15:03.996874"], ["id", 1]]

    def vacant_teams
        teams = Team.select { |team| team.activity_id == params[:sport_id] }
---
SELECT "teams".* FROM "teams"

    def my_teams
        teams = Team.select { |team| team.users.find{ |user| user.id == params[:user_id]}}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        team = Team.find(params[:id])
        team.update(team_params)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teams" SET "number_of_members" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["number_of_members", 2], ["updated_at", "2019-12-17 21:24:05.004526"], ["id", 1]]