app/controllers/api/v1/user_activities_controller.rb

    def index
        user_activities = UserActivity.all.sort_by{|u_activity| u_activity.id}
---
SELECT "user_activities".* FROM "user_activities"

    def create
        user_activity = {}
        params[:sports].each do |id|
            activity = Activity.find(id)
            activity.update(number_of_members: activity.number_of_members+1)
            user_activity = UserActivity.create(user_id: params[:user_id],activity_id: id)
        end
        if user_activity.save
            user_activities = UserActivity.select{ |check_user| check_user.user_id == params[:user_id]}
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "activities" SET "number_of_members" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["number_of_members", 1], ["updated_at", "2019-12-13 19:26:16.856116"], ["id", 6]]
INSERT INTO "user_activities" ("user_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["activity_id", 6], ["created_at", "2019-12-13 19:26:16.878517"], ["updated_at", "2019-12-13 19:26:16.878517"]]
SELECT "user_activities".* FROM "user_activities"