app/controllers/api/v1/user_teams_controller.rb

SELECT "user_teams".* FROM "user_teams"
---
    def index
        user_teams = UserTeam.all

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def show
        user_team = UserTeam.find(params[:id])

INSERT INTO "user_teams" ("signup_won_games", "signup_tie_games", "signup_lost_games", "user_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        user_team = UserTeam.create(user_team_params)