app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "first_name", "last_name", "email", "phone_number", "location", "birthday", "gender", "bio", "won_games", "tie_games", "lost_games", "admin", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
    def create
        user = User.create(user_params)